<html>
    <head>
        <title>RuMate</title>
        <meta charset="UTF-8">
        <link rel="stylesheet" href="css/style.css" media="all">
        <meta name="viewport" content="width=device-width, initial-scale=1">
        <meta name="Description" content="RuMate">
        <meta http-equiv="Content-language" content="ru-RU">
        <link rel="preconnect" href="https://fonts.googleapis.com">
        <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
        <link href="https://fonts.googleapis.com/css2?family=Inter:wght@300;400;700;900&family=Roboto&display=swap" rel="stylesheet">
    </head>
    <div class="wrapper">
        <div class="sideBar">
            <div class="menu">
	            <a href="/"><img class="icon" src="/images/file-text.svg" alt="Документация"></a>
	            <a href="/talks"><img class="icon" src="/images/chat-left-text.svg" alt="Ассистент"></a>
	            <a href="/settings"><img class="icon" src="/images/gear.svg" alt="Настройки"></a>
            </div>
        </div>
        <div class="page">
	        <div class="titleFlex">
		        <div class="title">
			        <img src="images/Rustore_logo_intro.svg" alt="RuStore" height="50px">
		        </div>
	        </div>
	        <div class="buttons">
				<div class="row_buttons">
					<a class="butt" href="/docs/?doc=users">
						<svg width="112" height="112" viewBox="0 0 112 112" fill="none" xmlns="http://www.w3.org/2000/svg" class="cardIcon_RagH"><path style="fill:#07f;stroke-width:0" fill-rule="evenodd" clip-rule="evenodd" d="M42 9c-10.493 0-19 8.507-19 19v56c0 10.493 8.507 19 19 19h28c10.493 0 19-8.507 19-19V28c0-10.493-8.507-19-19-19H42ZM29 28c0-7.18 5.82-13 13-13h28c7.18 0 13 5.82 13 13v56c0 7.18-5.82 13-13 13H42c-7.18 0-13-5.82-13-13V28Zm23 54a3 3 0 1 0 0 6h8a3 3 0 1 0 0-6h-8Z" fill="currentColor"></path></svg>
						<span class="row_title">Для пользователей</span>
						<span class="row_description">Скачивайте привычные сервисы и игры без ограничений — это удобно и безопасно</span>
					</a>
					<a class="butt" href="/docs/?doc=developers">
						<svg width="112" height="112" viewBox="0 0 112 112" fill="none" xmlns="http://www.w3.org/2000/svg" class="cardIcon_RagH"><path style="fill:#07f;stroke-width:0" fill-rule="evenodd" clip-rule="evenodd" d="M32 19c-10.493 0-19 8.507-19 19v36c0 10.493 8.507 19 19 19h48c10.493 0 19-8.507 19-19V38c0-10.493-8.507-19-19-19H32Zm61 20v-1c0-7.18-5.82-13-13-13H32c-7.18 0-13 5.82-13 13v1h74Zm-74 6h74v29c0 7.18-5.82 13-13 13H32c-7.18 0-13-5.82-13-13V45Zm15.121 10.879L44.243 66 34.12 76.121a3 3 0 1 1-4.242-4.242L35.757 66l-5.878-5.879a3 3 0 1 1 4.242-4.242ZM56 71a3 3 0 1 0 0 6h16a3 3 0 1 0 0-6H56Z" fill="currentColor"></path></svg>
						<span class="row_title">Для разработчиков</span>
						<span class="row_description">Узнайте, как опубликовать приложение и подключить монетизацию с помощью консоли разработчика</span>
					</a>
					<a class="butt" href="/docs/?doc=sdk">
						<svg width="112" height="112" viewBox="0 0 112 112" fill="none" xmlns="http://www.w3.org/2000/svg" class="cardIcon_RagH"><path style="fill:#07f;stroke-width:0" fill-rule="evenodd" clip-rule="evenodd" d="M87.805 21.872a3 3 0 0 0-.828-4.828c-7.802-3.727-17.434-2.364-23.903 4.104-5.352 5.352-7.207 12.871-5.58 19.722L20.65 77.716c-4.296 4.296-4.296 11.26 0 15.556 4.295 4.295 11.26 4.295 15.556 0l17.407-17.408L71.44 93.692c4.296 4.296 11.26 4.296 15.556 0 4.296-4.296 4.296-11.26 0-15.556L69.168 60.308l3.882-3.882c6.852 1.628 14.37-.228 19.722-5.58 6.469-6.468 7.831-16.1 4.104-23.903a3 3 0 0 0-4.828-.828l-8.463 8.463-4.242-4.243 8.462-8.463Zm-20.488 3.519a14.98 14.98 0 0 1 12.729-4.244l-7.067 7.067a3 3 0 0 0 0 4.243l8.485 8.485a3 3 0 0 0 4.242 0l7.068-7.068a14.98 14.98 0 0 1-4.244 12.73c-4.162 4.161-10.163 5.37-15.4 3.611a3 3 0 0 0-3.076.722L31.962 89.03a5 5 0 1 1-7.07-7.07l38.091-38.093a3 3 0 0 0 .723-3.077c-1.76-5.235-.55-11.237 3.61-15.398Zm-44.915-5.683L13 29.11l10.134 13.03a5 5 0 0 0 7.483.465l.523-.523 8.481 8.48 4.243-4.242-8.481-8.48.515-.516a5 5 0 0 0-.466-7.482l-13.03-10.134Zm4.77 17.85 3.678-3.68-7.95-6.183-1.912 1.912 6.183 7.95Zm48.51 51.891L58.006 71.772l7.071-7.07 17.677 17.676a5 5 0 0 1-7.07 7.071Z" fill="currentColor"></path></svg>
						<span class="row_title">RuStore SDK</span>
						<span class="row_description">Подключайте инструменты разработчика для использования всех необходимых сервисов</span>
					</a>
					<a class="butt" href="/docs/?doc=guides">
						<svg width="112" height="112" viewBox="0 0 112 112" fill="none" xmlns="http://www.w3.org/2000/svg" class="cardIcon_RagH"><path style="fill:#07f;stroke-width:0" fill-rule="evenodd" clip-rule="evenodd" d="M56.975 8.016c.519-.003 1.038-.007 1.556-.007h.088c1.005.006 3.812.02 6.196 2.207 2.034 1.866 2.853 4.514 3.365 6.561.319 1.274.936 2.905 1.77 4.467a37.632 37.632 0 0 1 4.855 2.345c1.687-.337 3.284-.87 4.44-1.407 1.991-.927 4.807-2.067 7.781-1.416 3.027.661 4.783 2.937 5.283 3.585a96.255 96.255 0 0 0 2.854 3.523c.532.625 2.39 2.811 2.407 5.898.019 3.032-1.677 5.541-2.999 7.297-.813 1.08-1.72 2.642-2.418 4.324a37.51 37.51 0 0 1 1.164 5.123c1.345 1.179 2.813 2.16 3.995 2.763 1.959.999 4.586 2.513 5.902 5.25 1.337 2.782.626 5.559.423 6.353a96.769 96.769 0 0 0-1.02 4.417c-.166.802-.745 3.612-3.17 5.53-2.387 1.886-5.417 2.096-7.615 2.135-1.3.024-3.01.254-4.704.707l-.23.329h-7.712a31.856 31.856 0 0 0 4.058-5.37c2.879-1.08 6.067-1.608 8.48-1.652 4.362-.079 4.6-1.11 5.077-3.17l.952-4.124c.476-2.061.714-3.092-3.173-5.075-2.17-1.106-4.834-3.004-6.957-5.265a31.543 31.543 0 0 0-1.816-8.017c.913-2.988 2.49-5.892 3.966-7.854 2.624-3.485 1.958-4.307.626-5.951l-2.664-3.289c-1.332-1.644-1.998-2.466-5.954-.625-2.168 1.009-5.23 1.924-8.265 2.222a31.63 31.63 0 0 0-7.62-3.687c-1.71-2.567-2.95-5.568-3.538-7.916-.996-3.983-1.992-4.217-3.87-4.23l-4.597-.002c-2.117 0-3.175 0-4.233 4.232-.588 2.348-1.828 5.349-3.538 7.916a31.628 31.628 0 0 0-7.62 3.687c-3.035-.298-6.097-1.213-8.265-2.222-3.956-1.84-4.622-1.019-5.954.625l-2.665 3.289c-1.332 1.644-1.998 2.466.626 5.951 1.477 1.962 3.053 4.866 3.967 7.854a31.547 31.547 0 0 0-1.816 8.017c-2.123 2.261-4.788 4.159-6.958 5.265-3.887 1.983-3.649 3.014-3.172 5.075l.952 4.123c.476 2.062.714 3.092 5.077 3.171 2.413.044 5.601.572 8.48 1.652a31.88 31.88 0 0 0 5.279 6.604c.4 3.036.197 6.245-.302 8.595-.904 4.267.047 4.73 1.95 5.658l3.805 1.855c1.902.928 2.854 1.391 5.66-1.948 1.575-1.873 4.039-4.051 6.734-5.613 1.343.174 2.722.26 4.102.261v5.99c-.872 0-1.744-.03-2.606-.09-1.467 1.052-2.77 2.273-3.632 3.3-1.412 1.68-3.48 3.9-6.45 4.567-3.024.679-5.581-.643-6.309-1.019a96.511 96.511 0 0 0-4.075-1.987c-.746-.343-3.358-1.54-4.682-4.334-1.298-2.74-.823-5.73-.367-7.879.268-1.264.428-2.969.371-4.712a37.865 37.865 0 0 1-3.362-4.207c-1.695-.453-3.405-.683-4.705-.707-2.198-.04-5.227-.249-7.613-2.135-2.426-1.918-3.006-4.728-3.171-5.53a96.395 96.395 0 0 0-1.02-4.417c-.204-.794-.914-3.571.423-6.354 1.315-2.736 3.943-4.25 5.902-5.25 1.181-.602 2.65-1.583 3.995-2.762.27-1.749.66-3.46 1.163-5.123-.697-1.682-1.604-3.243-2.417-4.324-1.323-1.756-3.018-4.265-3-7.297.018-3.087 1.876-5.273 2.407-5.898a96.36 96.36 0 0 0 2.854-3.523c.5-.648 2.257-2.924 5.283-3.585 2.975-.651 5.79.489 7.782 1.416 1.155.537 2.752 1.07 4.44 1.407a37.625 37.625 0 0 1 4.855-2.345c.834-1.562 1.45-3.193 1.77-4.467.532-2.13 1.416-5.027 3.789-6.925 2.418-1.934 5.296-1.866 6.116-1.846 1.076.025 2.155.018 3.234.01Zm-.967 66.25c9.942 0 18.002-8.042 18.002-17.962s-8.06-17.961-18.002-17.961c-9.942 0-18.002 8.042-18.002 17.961 0 9.92 8.06 17.962 18.002 17.962Zm12.001-17.962c0 6.614-5.373 11.975-12.001 11.975-6.628 0-12.002-5.361-12.002-11.975 0-6.613 5.374-11.974 12.002-11.974 6.628 0 12.001 5.361 12.001 11.974Z" fill="currentColor"></path><path d="M103.755 102.006h-3.92v-19.74h3.92v19.74ZM82.469 102.006v-19.74h7.056c1.456 0 2.753.289 3.892.868 1.138.578 2.025 1.381 2.66 2.408.653 1.026.98 2.202.98 3.528 0 1.306-.327 2.473-.98 3.5-.635 1.026-1.53 1.838-2.688 2.436-1.139.578-2.427.868-3.864.868h-3.136v6.132h-3.92Zm7.056-9.632c1.082 0 1.941-.299 2.576-.896.634-.616.952-1.419.952-2.408 0-.99-.318-1.783-.952-2.38-.635-.616-1.494-.924-2.576-.924h-3.136v6.608h3.136ZM80.243 102.006H76.1l-1.4-3.948h-8.988l-1.428 3.948h-4.088l7.532-19.74h5.208l7.308 19.74ZM69.967 86.41l-2.94 8.064h6.412l-2.828-8.064h-.644Z" fill="currentColor"></path></svg>
						<span class="row_title">RuStore API</span>
						<span class="row_description">Автоматизируйте процессы обновлений и управления версиями через API</span>
					</a>
					<a class="butt" href="/docs/?doc=work-with-rustore-api">
						<svg width="112" height="112" viewBox="0 0 112 112" fill="none" xmlns="http://www.w3.org/2000/svg" class="cardIcon_RagH"><path d="M43.3 25.8h3.3c.4 6 5.4 10.8 11.5 10.8h19.5c6.3 0 11.5-5.2 11.5-11.5v-4.6C89.1 14.2 83.9 9 77.6 9H58.1C52 9 47 13.8 46.6 19.8h-3.3c-6.3 0-11.5 5.2-11.5 11.5V53H26c-1.7 0-3 1.3-3 3s1.3 3 3 3h5.8v22.2c0 6.3 5.2 11.5 11.5 11.5h3.3c.6 5.8 5.5 10.3 11.4 10.3h19.5c6.3 0 11.5-5.2 11.5-11.5v-4.6c0-6.3-5.2-11.5-11.5-11.5H58c-6.3 0-11.4 5-11.5 11.3h-3.2c-3 0-5.5-2.5-5.5-5.5V59h8.8c.4 6 5.4 10.8 11.5 10.8h19.5c6.3 0 11.5-5.2 11.5-11.5v-4.6c0-6.3-5.2-11.5-11.5-11.5H58.1C52 42.2 47 47 46.6 53h-8.8V31.3c0-3 2.5-5.5 5.5-5.5Zm9.2-5.3c0-3 2.5-5.5 5.5-5.5h19.5c3 0 5.5 2.5 5.5 5.5v4.6c0 3-2.5 5.5-5.5 5.5H58c-3 0-5.5-2.5-5.5-5.5v-4.6Zm0 66.4c0-3 2.5-5.5 5.5-5.5h19.5c3 0 5.5 2.5 5.5 5.5v4.6c0 3-2.5 5.5-5.5 5.5H58c-3 0-5.5-2.5-5.5-5.5v-4.6Zm0-33.2c0-3 2.5-5.5 5.5-5.5h19.5c3 0 5.5 2.5 5.5 5.5v4.6c0 3-2.5 5.5-5.5 5.5H58c-3 0-5.5-2.5-5.5-5.5v-4.6Z" style="fill:#07f;stroke-width:0"></path></svg>
						<span class="row_title">Сценарии использования</span>
						<span class="row_description">Пошаговые руководства по интеграции наших сервисов</span>
					</a>
				</div>
	        </div>
	        <div class="pg-center">
		        <div class="titleFlex">
			        <div class="stitle">Посоветуйтесь с ИИ</div>
		        </div>
		        <div class="pc-content">
			        <form id="uploadForm" method="GET" enctype="multipart/form-data" action="talks">
				        <input type="hidden" name="a" value="new">
				        <label class="input-file">
					        <input type="text" name="q" placeholder="Введите запрос">
				        </label>
				        <button type="submit">
					        <img src="images/stars.svg" alt="Submit">
				        </button>
			        </form>
		        </div>
	        </div>
        </div>
    </div>
</html>
